АлогистикТест2/src/Documents/алк_ЗагрузкаВКамеру/алк_ЗагрузкаВКамеру.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ЗагрузкаВКамеру</name>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаСкладахСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПакетыВСушильныхКамерах</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СушильнаяКамера</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Техкарта</name>
    <type>
      <types>CatalogRef.алк_ТехкартаСушки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОстанова</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦелеваяВлажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяВлажностьСредняя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяВлажностьСредняя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяВлажностьФактСредняя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Режим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимКомментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СобственнымиСилами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачальнаяВлажность</name>
    <attributes>
      <name>Влажность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонечнаяВлажность</name>
    <attributes>
      <name>Влажность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонечнаяВлажностьФакт</name>
    <attributes>
      <name>Влажность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователей</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.НастройкиПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.НастройкиПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/AccumulationRegisters/алк_ОстаткиЗапасов/алк_ОстаткиЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ОстаткиЗапасов</name>
  <resources>
    <name>Количество</name>
    <comment>Для пиловочника и пилмата это объем, для ДГ это вес</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/AccumulationRegisters/алк_ПроизводствоОборот/алк_ПроизводствоОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ПроизводствоОборот</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.алк_Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДвиженияПроизводства</name>
    <type>
      <types>EnumRef.алк_ВидыДвиженияПроизводствоОборот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Enums/алк_ВидыДвиженияПроизводствоОборот/алк_ВидыДвиженияПроизводствоОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыДвиженияПроизводствоОборот</name>
  <enumValues>
    <name>Списано</name>
  </enumValues>
  <enumValues>
    <name>Оприходовано</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Catalogs/алк_ОперацииПроизводства/алк_ОперацииПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_ОперацииПроизводства</name>
  <predefined>
    <items>
      <name>Досушка</name>
      <description>Досушка</description>
    </items>
    <items>
      <name>Дробление</name>
      <description>Дробление</description>
    </items>
    <items>
      <name>Лущение</name>
      <description>Лущение</description>
    </items>
    <items>
      <name>Окорка</name>
      <description>Окорка</description>
    </items>
    <items>
      <name>Отгрузка</name>
      <description>Отгрузка</description>
    </items>
    <items>
      <name>ОтгрузкаСудна</name>
      <description>Отгрузка судна</description>
    </items>
    <items>
      <name>ПереданоВОтгрузку</name>
      <description>Передано в отгрузку</description>
    </items>
    <items>
      <name>ПеремещениеПриход</name>
      <description>Перемещение приход</description>
    </items>
    <items>
      <name>ПеремещениеРасход</name>
      <description>Перемещение расход</description>
    </items>
    <items>
      <name>Пересортица</name>
      <description>Пересортица</description>
    </items>
    <items>
      <name>Переупаковка</name>
      <description>Переупаковка</description>
    </items>
    <items>
      <name>Прибыло</name>
      <description>Прибыло</description>
    </items>
    <items>
      <name>Приемка</name>
      <description>Приемка</description>
    </items>
    <items>
      <name>ПриемкаВПорту</name>
      <description>Приемка в порту</description>
    </items>
    <items>
      <name>ПриемкаПоГОСТ</name>
      <description>Приемка по ГОСТ</description>
    </items>
    <items>
      <name>ПроизводствоПоддонов</name>
      <description>Производство поддонов</description>
    </items>
    <items>
      <name>ПроизводствоТопливныхБрикетов</name>
      <description>Производство топливных брикетов</description>
    </items>
    <items>
      <name>ПроизводствоФанеры</name>
      <description>Производство фанеры</description>
    </items>
    <items>
      <name>Разгружено</name>
      <description>Разгружено</description>
    </items>
    <items>
      <name>Распил</name>
      <description>Распил</description>
    </items>
    <items>
      <name>Ребросклей</name>
      <description>Ребросклей</description>
    </items>
    <items>
      <name>РучнаяСортировка</name>
      <description>Ручная сортировка</description>
    </items>
    <items>
      <name>СборкаРазборкаПакета</name>
      <description>Сборка/Разборка пакета</description>
    </items>
    <items>
      <name>Списание</name>
      <description>Списание</description>
    </items>
    <items>
      <name>Сушка</name>
      <description>Сушка</description>
    </items>
    <items>
      <name>Упаковка</name>
      <description>Упаковка</description>
    </items>
    <items>
      <name>УпаковкаФанеры</name>
      <description>Упаковка фанеры</description>
    </items>
    <items>
      <name>ФорматнаяОбрезка</name>
      <description>Форматная обрезка</description>
    </items>
    <items>
      <name>ЧисленныйСоставСмены</name>
      <description>Численный состав смены (общая)</description>
    </items>
    <items>
      <name>ШлифованиеФанеры</name>
      <description>Шлифование фанеры</description>
    </items>
  </predefined>
  <attributes>
    <name>ЗапросПолученияБюджета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросПолученияПлана</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросПолученияФакта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОперацииДляЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>63</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантИтогов</name>
    <type>
      <types>EnumRef.алк_ВариантыИтогов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗависитОтОпераций</name>
    <comment>Используется в механизме расчета показателей для настраиваемых отчетов</comment>
    <attributes>
      <name>ОперацияПроизводства</name>
      <type>
        <types>CatalogRef.алк_ОперацииПроизводства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеВТ</name>
    <attributes>
      <name>ВТ</name>
      <type>
        <types>CatalogRef.алк_ВТ_ДляРасчетаПоказателейПроизводства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_ЗагрузкаВКамеру/ObjectModule.bsl
#Область ОбработчикиСобытий  

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
		
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.алк_ЗагрузкаВКамеру.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
	//алк_ПроизводствоОборот, алк_ОстаткиЗапасов ++
	Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(Дата) Тогда 
		РфпСервер.ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;

	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();

	РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ,, Ложь);
	
	КонтрольЗаполнения(Отказ)
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		СвойствоОрганизация = ПланыВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация;
		СвойствоПодразделение = ПланыВидовХарактеристик.НастройкиПользователей.ОсновноеПодразделение;
		
		СписокНастроек = Новый Массив;
		СписокНастроек.Добавить(СвойствоОрганизация);
		СписокНастроек.Добавить(СвойствоПодразделение);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПользователей.Настройка,
		|	НастройкиПользователей.Значение
		|ИЗ
		|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
		|ГДЕ
		|	НастройкиПользователей.Пользователь = &Пользователь
		|	И НастройкиПользователей.Настройка В(&СписокНастроек)";
		Запрос.УстановитьПараметр("Пользователь", ПользователиКлиентСервер.ТекущийПользователь());
		Запрос.УстановитьПараметр("СписокНастроек", СписокНастроек);
		
		ВыборкаИзРезультатаЗапроса = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
			
			Если ВыборкаИзРезультатаЗапроса.Настройка = СвойствоОрганизация Тогда
				Организация = ВыборкаИзРезультатаЗапроса.Значение;
			КонецЕсли;
			
			Если ВыборкаИзРезультатаЗапроса.Настройка = СвойствоПодразделение Тогда
				СтруктурнаяЕдиница = ВыборкаИзРезультатаЗапроса.Значение;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(Смена) Тогда
	//	Дата = РфпСервер.ПолучитьДатуВремяНачалоКонецСмены(Смена, ТекущаяДатаСеанса()).ДатаВремяКонцаСмены;
	//Иначе
	//	Дата = ТекущаяДатаСеанса();
	//КонецЕсли;
	
	Ответственный = ПользователиКлиентСервер.ТекущийПользователь(); 
	
КонецПроцедуры

// проверка 
// - камера пуста (нет остатков по этой камере)
// - пакеты заполнены (имеют характеристики)
// - пакеты не сушились ранее
// - пакеты в камере не повторяются
Процедура КонтрольЗаполнения(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли; 
	
	// контроль не заполненности камеры
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОстатки.СерийныйНомер КАК СерийныйНомер
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
		|			&ДатаСреза,
		|			Штабель = &СушильнаяКамера
		|				И СтруктурнаяЕдиница = &Склад) КАК алк_ОстаткиЗапасовОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	алк_ПроизводствоОборот.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.алк_ПроизводствоОборот КАК алк_ПроизводствоОборот
		|ГДЕ
		|	алк_ПроизводствоОборот.СерийныйНомер В
		|			(ВЫБРАТЬ
		|				ВТ.СерийныйНомер
		|			ИЗ
		|				ВТ КАК ВТ)
		|	И алк_ПроизводствоОборот.Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
		|	И алк_ПроизводствоОборот.ВидДвиженияПроизводства = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано)
		|	И алк_ПроизводствоОборот.Период МЕЖДУ &ДатаОт И &ДатаСреза";
	
	Запрос.УстановитьПараметр("ДатаОт", 	Дата - 24*3600*365);  // более года не проверяем
	Запрос.УстановитьПараметр("ДатаСреза", Дата); 
	Запрос.УстановитьПараметр("СушильнаяКамера", СушильнаяКамера);
	Запрос.УстановитьПараметр("Склад",СтруктурнаяЕдиницаПолучатель);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить("Камера не пуста!");
		Сообщить("Документ загрузки: " + ВыборкаДетальныеЗаписи.Регистратор);
		Отказ = Истина;
		Прервать;
	КонецЦикла;
	
		
	//пакеты в камере не повторяются	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ЗагрузкаВКамеруНоменклатура.СерийныйНомер,
		|	СУММА(1) КАК Количество
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.алк_ЗагрузкаВКамеру.Номенклатура КАК алк_ЗагрузкаВКамеруНоменклатура
		|ГДЕ
		|	алк_ЗагрузкаВКамеруНоменклатура.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ЗагрузкаВКамеруНоменклатура.СерийныйНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.СерийныйНомер
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.Количество > 1";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	 			
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить("Пакет внесен несколько раз! Пакет: " + ВыборкаДетальныеЗаписи.СерийныйНомер);
		Отказ = Истина;
	КонецЦикла;  

	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
КонецПроцедуры

#КонецОбласти
